from django.http import JsonResponse
from django.shortcuts import render

from accounts.models import IPUserProfile, RandomNickName

import random


def generate_random_nickname():
    adjective_list = ["가냘픈", "가녀린", "가벼운", "고운", "귀여운", "기쁜", "까만", "새까만", "검은", "날쌘", "날카로운", "너그러운", "노란", "놀라운", "누런", "느린", "동그란", "둥그런", "매끄러운", "무거운", "미끄러운", "바쁜", "반가운", "밝은", "부끄러운", "부드러운", "붉은", "빨간", "비싼", "뽀얀", "수줍은", "시끄러운", "싱그러운", "아리따운", "어여쁜", "여린", "예쁜", "이쁜", "자그마한", "조그마한", "작은", "재밌는", "젊은", "점잖은", "즐거운", "파란", "푸른", "하얀", "흰", "가느다란", "길쭉한", "기다란", "긴", "감격한", "강한", "갸름한", "걸걸한", "건전한", "경이로운", "고급스러운", "고상한", "귀한", "귀중한", "극진한", "근사한", "까끌까끌한", "까슬까슬한", "까칠까칠한", "깐깐한", "깔끔한", "깜찍한", "깨끗한", "나긋나긋한", "나른한", "날씬한", "낭랑한", "느긋한", "느끼한", "늘씬한", "다정다감한", "다소곳한", "다재다능한", "단정한", "담대한", "당당한", "대견한", "대단한", "대범한", "독특한", "둥그스름한", "든든한", "듬직한", "따뜻한", "따스한", "뛰어난", "만족스러운", "말랑말랑한", "매끈한", "멋진", "명랑한", "명석한", "명쾌한", "몽글몽글한", "뭉클한", "무난한", "무뚝뚝한", "민첩한", "바람직한", "바삭바삭한", "박복한", "박식한", "박학다식한", "반듯한", "반들반들한", "반투명한", "반짝반짝한", "번듯한", "번쩍번쩍한", "변화무쌍한", "보들보들한", "보배로운", "보송보송한", "복스러운", "복슬복슬한", "똑똑한", "부들부들한", "부산스러운", "부유한", "부지런한", "분주한", "빼어난", "뽀송뽀송한", "사근사근한", "서글서글한", "사랑스러운", "산뜻한", "상냥한", "상쾌한", "상큼한", "생기발랄한", "선한", "소심한", "수상한", "수수한", "순박한", "순수한", "슬기로운", "시끌시끌한", "시원시원한", "신비로운", "신중한", "심심한", "싹싹한", "쑥스러운", "씩씩한", "아기자기한", "아름다운", "어른스러운", "아리송한", "안전한", "앙증맞은", "야무진", "알록달록한", "엄청난", "엉뚱한", "영롱한", "영리한", "영특한", "예사롭지않은", "온화한", "용감한", "용맹한", "우직한", "완벽한", "위대한", "유능한", "유명한", "유복한", "유식한", "유쾌한", "의젓한", "인자한", "자비로운", "자신만만한", "자유분방한", "전지전능한", "정직한", "조곤조곤한", "조용한", "진솔한", "진실한", "진중한", "진지한", "짱짱한", "차분한", "착실한", "착한", "찬란한", "참한", "참신한", "철저한", "촉촉한", "충실한", "친군한", "친밀한", "친절한", "침착한", "쾌활한", "쿨한", "큼직한", "탁월한", "태연한", "투명한", "특별한", "튼튼한", "파란만장한", "파릇파릇한", "팔팔한", " 편안한", "평온한", "평화로운", "푸근한", "푹신푹신한", "하늘하늘한", "한가로운", "행복한", "향기로운", "호리호리한", "호화로운", "홀쭉한", "화끈한", "화려한", "환한", "훌륭한", "흐뭇한", "흡족한", "흥미로운", "힙한"]
    noun_list = ["캥거루", "토끼", "강아지", "고양이", "코알라", "고릴라", "원숭이", "고래", "낙타", "물개", "소", "말", "돼지", "거북이", "악어", "호랑이", "표범", "치타", "늑대", "여우", "스컹크", "두더지", "돌고래", "도마뱀", "독수리", "바다표범", "가재", "원앙", "까마귀", "오리", "앵무새", "부엉이", "참새", "꾀꼬리", "나비", "잠자리", "이구아나", "카멜레온", "개미핥기", "거미", "잉어", "곰", "펭귄", "거위", "병아리", "닭", "갈매기", "코뿔소", "사슴", "코끼리", "하마", "다람쥐", "가오리", "가오리", "미어캣", "코브라", "자라", "두꺼비", "까치", "복어", "문어", "오리너구리", "너구리", "양", "꿩", "개구리", "메추라기", "산양", "딱따구리", "두루미", "달팽이", "노루", "뻐꾸기", "사자", "호랑이", "고슴도치", "가젤영양", "늑대", "원숭이", "고라니", "얼룩말", "족제피", "기린", "긴팔원숭이", "나무늘보", "낙타", "날다람쥐", "노란눈썹펭귄", "늘보원숭이", "주머니쥐", "다람쥐원숭이", "단봉낙타", "당나귀", "돌산양", "땃쥐", "라마", "반달가슴곰", "범고래", "뱅골호랑이", "북극곰", "북극여우", "불독", "목도리도마뱀", "비버", "비단원숭이", "사막여우", "산토끼", "샴고양이", "셰퍼드", "수달", "스라소니", "스컹크", "시베리아호랑이", "시베리안허스키", "아메리카너구리", "안경원숭이", "알파카", "오랑우탄", "오소리", "재규어", "청설모", "톰슨가젤", "팬더", "푸들", "퓨마", "하늘다람쥐", "흰수염고래", "시츄", "말티즈", "포메라니안", "비숑", "슈나우저", "닥스훈트", "요크셔테리어", "치와와", "진도개", "보더콜리", "사모예드", "달마시안", "골든리트리버", "도베르만", "시바견", "셰퍼드", "불테리어", "비글", "퍼그", "코커스파니엘", "보스턴테리어", "노르웨이숲", "러시안블루", "스핑크스고양이", "아비니시안", "페르시안고양이"]

    adjective = random.choice(adjective_list)
    noun = random.choice(noun_list)
    nickname = adjective + " " + noun

    while RandomNickName.objects.filter(nickname=nickname).first() != None :
        adjective = random.choice(adjective_list)
        noun = random.choice(noun_list)
        nickname = adjective + " " + noun

    return nickname


def get_ip_user(request):
    x_forwarded_for = request.META.get('HTTP_X_FORWARDED_FOR')

    if x_forwarded_for:
        ip_address = x_forwarded_for.split(',')[0]
    else:
        ip_address = request.META.get('REMOTE_ADDR')

    try:
        user = IPUserProfile.objects.get(ip_address=ip_address)
    except:
        user = IPUserProfile.objects.create(ip_address=ip_address)

    return JsonResponse({"pk": user.pk})
